---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures
source: html/ad4986cd-eaf6-5d3f-bf3b-65e09e8a80fa.htm
---
# BuiltInFailures.StructuralConnectionFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.